//раскладывает n на простые множители

let n = 24;
let arr = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199];

console.log(n)
while (n > 1){
    for(let i = 0; i < arr.length; i++){
        if(n % arr[i] == 0){ //если не делится на 2 то берет 3 в массиве и т.д
            n = n / arr[i];
            console.log(arr[i])
            break;
        }
    }
}
/* №1
n = 24;
console.log(n) -  выводим 24
while (n > 1) - пока n больше 1
for(let i = 0; i < arr.length; i++) - прохидит массив, а тело цикла находит первое простое число на которое делится на цело n 
if(n % arr[i] == 0) - 24/2
n = n / arr[i]; - 24/2=12
выводим 2
выходим с цикла for
теперь n = 12

№2
теперь в while (n > 1)
12/2
n = 6
выводим 2
выходим с цикла for

№3

*/